In [58]:
import pandas as pd

In [59]:
data = {
    'DateOfBirth': [2002, 2007, 1976, 1976],
    'Name': ["Ravshan", "Gulshan", "Feruza", "Muxiddin"],
    'Temp': [4, 5, 7, 9]
}

df = pd.DataFrame(data)

In [60]:
df

   DateOfBirth      Name  Temp
0         2002   Ravshan     4
1         2007   Gulshan     5
2         1976    Feruza     7
3         1976  Muxiddin     9

In [61]:
df.head()

   DateOfBirth      Name  Temp
0         2002   Ravshan     4
1         2007   Gulshan     5
2         1976    Feruza     7
3         1976  Muxiddin     9

In [62]:
df.head(3)

   DateOfBirth     Name  Temp
0         2002  Ravshan     4
1         2007  Gulshan     5
2         1976   Feruza     7

In [63]:
df.shape

(4, 3)

In [64]:
df.size

12

In [65]:
df = pd.DataFrame(data, columns=['Name', 'Temp', 'DateOfBirth'])

In [66]:
df.head()

       Name  Temp  DateOfBirth
0   Ravshan     4         2002
1   Gulshan     5         2007
2    Feruza     7         1976
3  Muxiddin     9         1976

In [67]:
df = pd.DataFrame(data, columns=['Name', 'Temp', 'DateOfBirth', 'isMarried'])

In [68]:
df.head()

       Name  Temp  DateOfBirth isMarried
0   Ravshan     4         2002       NaN
1   Gulshan     5         2007       NaN
2    Feruza     7         1976       NaN
3  Muxiddin     9         1976       NaN

In [69]:
df = pd.DataFrame(data, columns=['Name', 'Temp', 'DateOfBirth', 'isMarried'], index=[11, 17, 8, 10])

In [70]:
df

        Name  Temp  DateOfBirth isMarried
11   Ravshan     4         2002       NaN
17   Gulshan     5         2007       NaN
8     Feruza     7         1976       NaN
10  Muxiddin     9         1976       NaN

In [71]:
ismlar = df['Name']

In [72]:
type(ismlar)

pandas.core.series.Series

In [73]:
df.DateOfBirth

11    2002
17    2007
8     1976
10    1976
Name: DateOfBirth, dtype: int64

In [74]:
df['isMarried'] = False

In [75]:
df

        Name  Temp  DateOfBirth  isMarried
11   Ravshan     4         2002      False
17   Gulshan     5         2007      False
8     Feruza     7         1976      False
10  Muxiddin     9         1976      False

In [76]:
val = pd.Series([True, True], index=[8, 10])
df.isMarried = val

In [77]:
df

        Name  Temp  DateOfBirth isMarried
11   Ravshan     4         2002       NaN
17   Gulshan     5         2007       NaN
8     Feruza     7         1976      True
10  Muxiddin     9         1976      True

In [78]:
df['5+'] = df.Temp > 5

In [79]:
df

        Name  Temp  DateOfBirth isMarried     5+
11   Ravshan     4         2002       NaN  False
17   Gulshan     5         2007       NaN  False
8     Feruza     7         1976      True   True
10  Muxiddin     9         1976      True   True

In [80]:
df

        Name  Temp  DateOfBirth isMarried     5+
11   Ravshan     4         2002       NaN  False
17   Gulshan     5         2007       NaN  False
8     Feruza     7         1976      True   True
10  Muxiddin     9         1976      True   True

In [81]:
del df['5+']

In [82]:
df

        Name  Temp  DateOfBirth isMarried
11   Ravshan     4         2002       NaN
17   Gulshan     5         2007       NaN
8     Feruza     7         1976      True
10  Muxiddin     9         1976      True

In [83]:
val = pd.Series([False, False, True, True], index=[11, 17, 8, 10])
df['isMarried'] = val

In [84]:
df

        Name  Temp  DateOfBirth  isMarried
11   Ravshan     4         2002      False
17   Gulshan     5         2007      False
8     Feruza     7         1976       True
10  Muxiddin     9         1976       True

In [85]:
df['Name'].name = 'Ism'

In [86]:
df['Name']

11     Ravshan
17     Gulshan
8       Feruza
10    Muxiddin
Name: Ism, dtype: object

In [87]:
data = {
    'Uzbekistan':{2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9},
    'Kazakhstan':{2021:18.9, 2020:18.7, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8}
}
df = pd.DataFrame(data)

In [88]:
df

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [89]:
df.index.name = 'Yil'

In [90]:
df

      Uzbekistan  Kazakhstan
Yil
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [91]:
df = pd.DataFrame(data, index=[2021, 2019, 2017])

In [92]:
df

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2019        32.9        18.5
2017        31.9        18.1

In [93]:
df.T

            2021  2019  2017
Uzbekistan  33.9  32.9  31.9
Kazakhstan  18.9  18.5  18.1

In [94]:
arr = df.values

In [95]:
arr

array([[33.9, 18.9],
       [32.9, 18.5],
       [31.9, 18.1]])

In [96]:
type(arr)

numpy.ndarray